[
  {
    "content": "Question: Do we need to make a GUI for HW2\n\nDo we need to make a GUI for HW2? Or are we just making tests to show that our 4 classes work? Thank you.",
    "metadata": {
      "thread_id": 6165425,
      "title": "Do we need to make a GUI for HW2",
      "created_at": "2025-02-13T11:31:00.666758",
      "is_answered": false,
      "is_staff_answered": false,
      "category": "General",
      "subcategory": "",
      "answer_count": 0,
      "view_count": 40
    }
  },
  {
    "content": "Question: Github\n\nHey all, I am wondering what to do in terms of grader's access to my github repo. I know who my grader is for the group I am assigned to but how do I know what their github is?",
    "metadata": {
      "thread_id": 6165365,
      "title": "Github",
      "created_at": "2025-02-13T11:23:48.375452",
      "is_answered": false,
      "is_staff_answered": false,
      "category": "General",
      "subcategory": "",
      "answer_count": 0,
      "view_count": 49
    }
  },
  {
    "content": "Question: User Stories for HW 2 and Task 1\n\nFrom reading all the Ed Discussion posts I have deciphered that we need to decide which user stories apply to CRUD functionality. As far as I am concerned the only two items in the user story that applies strictly to CRUD are: As a student, I can see a list of questions others have asked that might be related to a question I am about to ask, so I do not waste my time waiting for answers already there, and others don’t waste their time reading and answering my question As a student, I can see a list of all unresolved questions and a list of the current potential answers for each so I can evaluate the potential answers and, if appropriate, propose a new potential answer without duplicating the work of others. And then I am implicitly adding a user story (which wasn't included in the document), that the user can modify and delete their questions/answers. This should cover all the bases of CRUD. So I just have three total user stories (for task 1). Two from the document and one that I inferred. Would this be a safe and correct approach?",
    "metadata": {
      "thread_id": 6165245,
      "title": "User Stories for HW 2 and Task 1",
      "created_at": "2025-02-13T11:11:55.813523",
      "is_answered": false,
      "is_staff_answered": false,
      "category": "General",
      "subcategory": "",
      "answer_count": 0,
      "view_count": 63
    }
  },
  {
    "content": "Question: Week 05 Live Event\n\nWill the Week 05 Live Event get uploaded to canvas?",
    "metadata": {
      "thread_id": 6164729,
      "title": "Week 05 Live Event",
      "created_at": "2025-02-13T10:13:43.181905",
      "is_answered": false,
      "is_staff_answered": false,
      "category": "General",
      "subcategory": "",
      "answer_count": 0,
      "view_count": 73
    }
  },
  {
    "content": "Question: UML Diagram Clarification\n\nFor the UML design (not sequence portion), must we make a class box with class name at the top, attributes listed with data type, and finally class methods with return types. This has been standard for UML diagrams. However no where in my investigation does this assignment specify what is expected for our UML diagrams. Based on the assignment description I looked here: \" Be sure to produce four UML Class Diagrams and at least one Sequence Diagram using the provided samples in the \"Architecture and Design Documents\" portion of the \"Individual Homeworks and Team Projects\" Module\" However, none of the provided examples are UML diagrams, only state machine, sequence diagrams, and High-Level Startup Flow diagrams. As far as the sequence diagram is concerned, expectations are fully specified (examples are given). I appreciate any clarification thank you.\n\n\nAnswer: [STAFF RESPONSE] There are examples in the textbook that can help you. If you have questions about one of the examples, please visit one of the numerous office hours available.",
    "metadata": {
      "thread_id": 6164225,
      "title": "UML Diagram Clarification",
      "created_at": "2025-02-13T09:33:03.036354",
      "is_answered": true,
      "is_staff_answered": true,
      "category": "Assignments",
      "subcategory": "Individual Assignment 2",
      "answer_count": 1,
      "view_count": 110
    }
  },
  {
    "content": "Question: About the implement for HW2 Questions and Answers\n\nDo we need to store all the questions and answers into SQL now or we just need to implement the Question, Answer, Questions, Answers class and ignore the storing for now?\n\n\nAnswer: [STAFF RESPONSE] What does the deliverables portion for this assignment ask you to do?\n\n\nAnswer: I'm storing mine in the database and testing it there as well. This is a requirement because CRUD operations (from my understanding) have to do with creating, reading, updating, and deleting. So I THINK those are in relation to how they operate in the database. If not then whatever it's extra work and it teaches me stuff anyways. Plus I have the CRUD operations completed with functionality so it can't be marked down anyways.",
    "metadata": {
      "thread_id": 6164136,
      "title": "About the implement for HW2 Questions and Answers",
      "created_at": "2025-02-13T09:24:16.536242",
      "is_answered": true,
      "is_staff_answered": true,
      "category": "Assignments",
      "subcategory": "Individual Assignment 2",
      "answer_count": 2,
      "view_count": 123
    }
  },
  {
    "content": "Question: Testing\n\nFor the testing, does it need to be automated, or can i just manually input the test case and show the subsequent ui error message or success message,\n\n\nAnswer: [STAFF RESPONSE] Manual testing is time-consuming and often error-prone. You will be required to do automated testing using JUnit after the midterm, so why not practice now?",
    "metadata": {
      "thread_id": 6163726,
      "title": "Testing",
      "created_at": "2025-02-13T08:42:37.335395",
      "is_answered": true,
      "is_staff_answered": true,
      "category": "General",
      "subcategory": "",
      "answer_count": 1,
      "view_count": 123
    }
  },
  {
    "content": "Question: Team project phase 2 not showing\n\nThe team project part of phase two isn't showing in modules, and I was pretty sure it was there previously, is it just a problem on my end or can everyone else not see it?\n\n\nAnswer: [STAFF RESPONSE] It will be posted by Friday.",
    "metadata": {
      "thread_id": 6163371,
      "title": "Team project phase 2 not showing",
      "created_at": "2025-02-13T08:03:44.415836",
      "is_answered": true,
      "is_staff_answered": true,
      "category": "General",
      "subcategory": "",
      "answer_count": 1,
      "view_count": 117
    }
  },
  {
    "content": "Question: HW2 GitHub Repo\n\nShould we make our GitHub repo for HW2 public or can we just add our group's grader to it?\n\n\nAnswer: [STAFF RESPONSE] Private, always private for this class. And about adding your group's grader, that's a great question, we will get back to you.\n\n\nAnswer: [STAFF RESPONSE] If your GitHub is public, someone copies your code, uses it, and gets caught, you will be liable for an academic integrity violation, along with the person who did the copying.",
    "metadata": {
      "thread_id": 6163108,
      "title": "HW2 GitHub Repo",
      "created_at": "2025-02-13T07:34:06.295906",
      "is_answered": true,
      "is_staff_answered": true,
      "category": "General",
      "subcategory": "",
      "answer_count": 2,
      "view_count": 161
    }
  },
  {
    "content": "Question: For HW2\n\nHello there, For HW2 I used the same as foundation login/singup page with features added. And then users can login in a discussion form look covers exactly 90% of what Ed Discussion does, is this acceptable to do extra features for my submission? like it will show the user who posted user can/edit post, reply with a comment, like etc.. I am going to do all what is needed from me in the Template and added these extra features is this fine, or that will affect me not getting full grade?\n\n\nAnswer: Based on common responses in Ed discussion about extra features, simply put, as long as deliverables have been met, you can add extra features. (they won't contribute to the assignment grade, ie extra credit)\n\n\nAnswer: [STAFF RESPONSE] Yes, but make sure you highlight the basic requirements first in your submission so as to make it easier for the graders to grade\n\n\nAnswer: [STAFF RESPONSE] There is no need to sign in to HW2. There are no roles. You are just creating and testing classes you will need to use in TP2. Please read the deliverables for each assignment carefully. Where does it suggest that you need to log in?",
    "metadata": {
      "thread_id": 6162475,
      "title": "For HW2",
      "created_at": "2025-02-13T06:23:13.379237",
      "is_answered": true,
      "is_staff_answered": true,
      "category": "General",
      "subcategory": "",
      "answer_count": 3,
      "view_count": 235
    }
  }
]